from aiogram import executor
from bot_app import dp


if __name__ == '__main__': # Ця конструкція перевіряє, чи файл був запущений безпосередньо, а не імпортований як модуль. Це потрібно, щоб код всередині цієї умови виконувався тільки при безпосередньому запуску файлу.
    # розпочинає отримання повідомлень від користувачів за допомогою методу start_polling об'єкта executor. Передається об'єкт, який відповідає за обробку повідомлень, і вказується що бот повинен пропустити всі необроблені повідомлення, які надійшли до нього до цього моменту
    executor.start_polling(dp, skip_updates=True)