import logging

"""Імпорти в __init__.py виконуються для підготовки модуля до використання та забезпечення зручності управління імпортами у  проекті. 

from .app import dp:  означає, що ви імпортуєте об'єкт dp з модуля app, який знаходиться в тому самому пакеті, що і __init__.py. Відносний імпорт з . вказує на поточний пакет або модуль.

from . import commands: означає, що ви імпортуєте модуль commands з поточного пакету, який міститься в тому самому пакеті, що і __init__.py. Це дозволяє використовувати функції, класи або інші об'єкти, які визначені в модулі commands, всередині поточного пакету.

Використання таких імпортів в __init__.py дозволяє зручно організовувати модулі вашого пакету і забезпечує зручну навігацію та використання об'єктів з інших модулів всередині пакету."""

from .app import dp
from . import commands, random_ten, one_by_one

# Вмикаємо логування на рівні INFO
logging.basicConfig(level=logging.INFO)